final/job_portal_test_case/app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT ?  [["LIMIT", 1]]
---
  def index
    # debugger
    @users = User.all

INSERT INTO "users" ("user_name", "password_digest", "email", "type", "created_at", "updated_at", "reset_password_token", "reset_password_sent_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    byebug
    user = User.new(user_params)
    if user.save

UPDATE "users" SET "user_name" = ?, "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["user_name", "its_ram"], ["email", "ramkush@gmail.com"], ["updated_at", "2023-10-13 05:57:18.661214"], ["id", 6]]
---
  def update
    debugger
    if @current_user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 41]]
---
  def destroy
    if @current_user.destroy